{
  "default": {
    "Do I need to root my device to flash OxygenOS?": "No, however your phone needs to be unlocked. ",
    "Will I get OTAs after I flash OxygenOS for future updates?": "Yes for every device except for the OnePlus One. OxygenOS is a community ROM for the OnePlus One. The official ROM is CyanogenOS.",
    "Do I need to wipe my data to flash OxygenOS?": " Please follow the flashing instructions carefully. In some cases we support upgrading without a data wipe.\n\rHowever, if you are coming from a system other than OxygenOS, then most likely you would need to do a factory reset. If you are not sure, please contact our customer support.",
    "Do you support rooted users?": "We do not officially support rooted users, there isn't a good way for us to guarantee the stability of the system when the device is rooted.\n\rHowever, we do have many rooted users and the OnePlus forum is probably the best place to get answers if you have a question about rooting.",
    "Can we use another recovery system other than the Oxygen recovery?": "TWRP is a popular recovery and we have provided flashing instructions if you are using TWRP on the OnePlus 2 and X.\n\rThe instructions we have provided are device specific, so please make sure you read the instructions for your device."
  },
  "OnePlus 2": {
    "Beta": {
      "Do I need to root my device to flash OxygenOS?": "No, however your phone needs to be unlocked. ",
      "Will I get OTAs after I flash OxygenOS for future updates?": "Yes for every device except for the OnePlus One. OxygenOS is a community ROM for the OnePlus One. The official ROM is CyanogenOS.",
      "Do I need to wipe my data to flash OxygenOS?": " Please follow the flashing instructions carefully. In some cases we support upgrading without a data wipe.\n\rHowever, if you are coming from a system other than OxygenOS, then most likely you would need to do a factory reset. If you are not sure, please contact our customer support.",
      "Do you support rooted users?": "We do not officially support rooted users, there isn't a good way for us to guarantee the stability of the system when the device is rooted.\n\rHowever, we do have many rooted users and the OnePlus forum is probably the best place to get answers if you have a question about rooting.",
      "Can we use another recovery system other than the Oxygen recovery?": "We only support dirty flashing of this build using Oxygen recovery. Dirty flashing requires OxygenOS 2.2.0 or higher.\n\rFactory reset is needed if you are using any other recovery or coming from any other ROM. We do not guarantee these cases to work properly."
    }
  }
}